{
  "project_id": "uk-dta-gsmanalytics-poc",
  "dataset_id": "metricmind",
  "tables": [
    {
      "table_name": "GSM_KPI_DATA_TEST_V4",
      "description": "This table contains the actual KPI details for all our KPI sets that have been implemented here so far.  Each row in the table is one of a number of entries for that KPI set.",
      "schema": [
        {
          "name": "KPI_DATE",
          "type": "DATE",
          "description": "The calendar date to which this set of KPI data applies."
        },
        {
          "name": "KPI_WEEK",
          "type": "STRING",
          "description": "The Sky / Comcast week that the KPI date above falls into."
        },
        {
          "name": "KPI_ID",
          "type": "INTEGER",
          "description": "The unique identifier for the KPI allowing us to link to its definition data."
        },
        {
          "name": "KPI_GROUP_ID",
          "type": "INTEGER",
          "description": "The identifier of the KPI group that the KPI is a part of."
        },
        {
          "name": "COUNTRY",
          "type": "STRING",
          "description": "The Sky country or territory that the KPI data applies to."
        },
        {
          "name": "OPERATOR",
          "type": "STRING",
          "description": "The division or operator within Sky that the KPI applies to, e.g. Sky or Now."
        },
        {
          "name": "DIM1",
          "type": "STRING",
          "description": "The string value of the first dimension by which we can analyse the KPI data."
        },
        {
          "name": "DIM2",
          "type": "STRING",
          "description": "The string value of the second dimension by which we can analyse the KPI data."
        },
        {
          "name": "DIM3",
          "type": "STRING",
          "description": "The string value of the third dimension by which we can analyse the KPI data."
        },
        {
          "name": "DIM4",
          "type": "STRING",
          "description": "The string value of the fourth dimension by which we can analyse the KPI data."
        },
        {
          "name": "DIM5",
          "type": "STRING",
          "description": "The string value of the fifth dimension by which we can analyse the KPI data."
        },
        {
          "name": "DIM6",
          "type": "STRING",
          "description": "The string value of the sixth dimension by which we can analyse the KPI data."
        },
        {
          "name": "INT01",
          "type": "INTEGER",
          "description": "The first integer resultof our KPI which can be summed across the various dimensions as needed."
        },
        {
          "name": "INT02",
          "type": "INTEGER",
          "description": "The second integer resultof our KPI which can be summed across the various dimensions as needed."
        },
        {
          "name": "INT03",
          "type": "INTEGER",
          "description": "The third integer resultof our KPI which can be summed across the various dimensions as needed."
        },
        {
          "name": "INT04",
          "type": "INTEGER",
          "description": "The fourth integer resultof our KPI which can be summed across the various dimensions as needed."
        },
        {
          "name": "INT05",
          "type": "INTEGER",
          "description": "The fifth integer resultof our KPI which can be summed across the various dimensions as needed."
        },
        {
          "name": "INT06",
          "type": "INTEGER",
          "description": "The sixth integer resultof our KPI which can be summed across the various dimensions as needed."
        },
        {
          "name": "INT07",
          "type": "INTEGER",
          "description": "The seventh integer resultof our KPI which can be summed across the various dimensions as needed."
        },
        {
          "name": "INT08",
          "type": "INTEGER",
          "description": "The eighth integer resultof our KPI which can be summed across the various dimensions as needed."
        },
        {
          "name": "INT09",
          "type": "INTEGER",
          "description": "The ninth integer resultof our KPI which can be summed across the various dimensions as needed."
        },
        {
          "name": "INT10",
          "type": "INTEGER",
          "description": "The tenth integer resultof our KPI which can be summed across the various dimensions as needed."
        },
        {
          "name": "FLOAT01",
          "type": "FLOAT",
          "description": "The first floating point result of our KPI"
        },
        {
          "name": "FLOAT02",
          "type": "FLOAT",
          "description": "The second floating point result of our KPI"
        },
        {
          "name": "FLOAT03",
          "type": "FLOAT",
          "description": "The third floating point result of our KPI"
        },
        {
          "name": "FLOAT04",
          "type": "FLOAT",
          "description": "The fourth floating point result of our KPI"
        },
        {
          "name": "FLOAT05",
          "type": "FLOAT",
          "description": "The fifth floating point result of our KPI"
        },
        {
          "name": "FLOAT06",
          "type": "FLOAT",
          "description": "The sixth floating point result of our KPI"
        }
      ]  
    }
  ]
}
